# BlendStartParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BlendStartParam Property
ParameterTypeId Class See Also
---
"First End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BlendStartParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BlendStartParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BlendStartParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace